## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ❌ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff
data.http.datadog_metric_metadata["grants_ingest.DownloadGrantsGovDB.source_size"]: Reading...
module.SplitGrantsGovXMLDB.module.lambda_function.data.external.archive_prepare[0]: Reading...
data.http.datadog_metric_metadata["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"]: Reading...
data.http.datadog_metric_metadata["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"]: Reading...
module.DownloadGrantsGovDB.module.lambda_function.data.external.archive_prepare[0]: Reading...
module.PersistGrantsGovXMLDB.module.lambda_function.data.external.archive_prepare[0]: Reading...
data.http.datadog_metric_metadata["grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"]: Reading...
data.http.datadog_metric_metadata["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"]: Reading...
data.http.datadog_metric_metadata["grants_ingest.DownloadGrantsGovDB.source_size"]: Read complete after 1s [id=https://api.datadoghq.com/api/v1/metrics/grants_ingest.DownloadGrantsGovDB.source_size]
data.http.datadog_metric_metadata["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"]: Read complete after 1s [id=https://api.datadoghq.com/api/v1/metrics/grants_ingest.SplitGrantsGovXMLDB.opportunity.created]
data.http.datadog_metric_metadata["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"]: Read complete after 1s [id=https://api.datadoghq.com/api/v1/metrics/grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped]
data.http.datadog_metric_metadata["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"]: Read complete after 1s [id=https://api.datadoghq.com/api/v1/metrics/grants_ingest.SplitGrantsGovXMLDB.opportunity.updated]
data.http.datadog_metric_metadata["grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"]: Read complete after 1s [id=https://api.datadoghq.com/api/v1/metrics/grants_ingest.SplitGrantsGovXMLDB.opportunity.failed]
datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"]: Refreshing state... [id=grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped]
datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"]: Refreshing state... [id=grants_ingest.SplitGrantsGovXMLDB.opportunity.updated]
datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"]: Refreshing state... [id=grants_ingest.SplitGrantsGovXMLDB.opportunity.created]
datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"]: Refreshing state... [id=grants_ingest.DownloadGrantsGovDB.source_size]
datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"]: Refreshing state... [id=grants_ingest.SplitGrantsGovXMLDB.opportunity.failed]
datadog_dashboard.service_dashboard[0]: Refreshing state... [id=r2k-2tv-mui]
module.SplitGrantsGovXMLDB.module.lambda_function.data.aws_region.current: Reading...
module.PersistGrantsGovXMLDB.module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.DownloadGrantsGovDB.module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.PersistGrantsGovXMLDB.module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/grants_ingest-staging-PersistGrantsGovXMLDB]
module.DownloadGrantsGovDB.module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/grants_ingest-staging-DownloadGrantsGovDB]
module.grants_prepared_dynamodb_table.aws_dynamodb_table.default[0]: Refreshing state... [id=grantsingest-staging-prepareddata]
module.DownloadGrantsGovDB.module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.SplitGrantsGovXMLDB.module.lambda_function.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.PersistGrantsGovXMLDB.module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.PersistGrantsGovXMLDB.module.lambda_function.data.aws_partition.current: Reading...
module.DownloadGrantsGovDB.module.lambda_function.data.aws_caller_identity.current: Reading...
module.PersistGrantsGovXMLDB.module.lambda_function.data.aws_caller_identity.current: Reading...
module.PersistGrantsGovXMLDB.module.lambda_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.DownloadGrantsGovDB.module.lambda_function.data.aws_partition.current: Reading...
module.DownloadGrantsGovDB.module.lambda_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.SplitGrantsGovXMLDB.module.lambda_function.data.aws_caller_identity.current: Reading...
module.DownloadGrantsGovDB.module.lambda_function.data.aws_caller_identity.current: Read complete after 0s [id=357150818708]
module.DownloadGrantsGovDB.module.lambda_function.data.aws_region.current: Reading...
module.DownloadGrantsGovDB.module.lambda_function.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.SplitGrantsGovXMLDB.module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/grants_ingest-staging-SplitGrantsGovXMLDB]
module.PersistGrantsGovXMLDB.module.lambda_function.data.aws_caller_identity.current: Read complete after 0s [id=357150818708]
module.DownloadGrantsGovDB.data.aws_caller_identity.current: Reading...
module.SplitGrantsGovXMLDB.module.lambda_function.data.aws_caller_identity.current: Read complete after 0s [id=357150818708]
data.aws_ssm_parameter.datadog_api_key_secret_arn[0]: Reading...
module.DownloadGrantsGovDB.data.aws_caller_identity.current: Read complete after 0s [id=357150818708]
module.SplitGrantsGovXMLDB.module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.SplitGrantsGovXMLDB.module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
aws_sqs_queue.ffis_downloads: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/357150818708/ffis_downloads]
aws_scheduler_schedule_group.default[0]: Refreshing state... [id=grants_ingest-staging]
aws_ses_receipt_rule_set.ffis_ingest: Refreshing state... [id=grants_ingest-staging-ffis_ingest]
module.SplitGrantsGovXMLDB.module.lambda_function.data.aws_partition.current: Reading...
module.SplitGrantsGovXMLDB.module.lambda_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.PersistGrantsGovXMLDB.module.lambda_function.data.aws_region.current: Reading...
module.PersistGrantsGovXMLDB.module.lambda_function.data.aws_region.current: Read complete after 0s [id=us-west-2]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-west-2]
data.aws_partition.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.datadog_api_key_secret_arn[0]: Read complete after 0s [id=/grants_ingest/staging/deploy-config/datadog/api_key_secret_arn]
module.DownloadGrantsGovDB.data.aws_iam_policy_document.scheduler_execution-trust: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=357150818708]
module.DownloadGrantsGovDB.data.aws_iam_policy_document.scheduler_execution-trust: Read complete after 0s [id=748816237]
data.aws_iam_policy_document.read_datadog_api_key_secret[0]: Reading...
data.aws_iam_policy_document.read_datadog_api_key_secret[0]: Read complete after 0s [id=3983084962]
module.DownloadGrantsGovDB.module.lambda_function.data.aws_iam_policy_document.logs[0]: Reading...
module.PersistGrantsGovXMLDB.module.lambda_function.data.aws_iam_policy_document.logs[0]: Reading...
module.PersistGrantsGovXMLDB.module.lambda_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1680940209]
module.DownloadGrantsGovDB.module.lambda_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3988067030]
module.DownloadGrantsGovDB.aws_iam_role.scheduler_execution[0]: Refreshing state... [id=grants_ingest-staging-scheduler_exec20230404182115711400000001]
module.SplitGrantsGovXMLDB.module.lambda_function.data.aws_iam_policy_document.logs[0]: Reading...
module.SplitGrantsGovXMLDB.module.lambda_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=7366989]
module.PersistGrantsGovXMLDB.module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::357150818708:policy/grants_ingest-staging-PersistGrantsGovXMLDB-logs]
module.SplitGrantsGovXMLDB.module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=grants_ingest-staging-SplitGrantsGovXMLDB]
module.DownloadGrantsGovDB.module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::357150818708:policy/grants_ingest-staging-DownloadGrantsGovDB-logs]
module.DownloadGrantsGovDB.module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=grants_ingest-staging-DownloadGrantsGovDB]
module.PersistGrantsGovXMLDB.module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=grants_ingest-staging-PersistGrantsGovXMLDB]
module.SplitGrantsGovXMLDB.module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::357150818708:policy/grants_ingest-staging-SplitGrantsGovXMLDB-logs]
aws_ses_active_receipt_rule_set.active[0]: Refreshing state... [id=grants_ingest-staging-ffis_ingest]
aws_dynamodb_contributor_insights.grants_prepared_dynamodb_main[0]: Refreshing state... [id=name:grantsingest-staging-prepareddata/index:/357150818708]
module.DownloadGrantsGovDB.module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=grants_ingest-staging-DownloadGrantsGovDB-20230404222446837800000003]
module.SplitGrantsGovXMLDB.module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=grants_ingest-staging-SplitGrantsGovXMLDB-20230404222446803300000001]
module.PersistGrantsGovXMLDB.module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=grants_ingest-staging-PersistGrantsGovXMLDB-20230515134927066800000001]
module.lambda_artifacts_bucket.data.aws_partition.current[0]: Reading...
module.grants_source_data_bucket.data.aws_canonical_user_id.default[0]: Reading...
module.lambda_artifacts_bucket.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.lambda_artifacts_bucket.data.aws_canonical_user_id.default[0]: Reading...
module.grants_source_data_bucket.data.aws_partition.current[0]: Reading...
module.grants_source_data_bucket.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.grants_prepared_data_bucket.data.aws_partition.current[0]: Reading...
module.grants_prepared_data_bucket.data.aws_canonical_user_id.default[0]: Reading...
module.email_delivery_bucket.data.aws_partition.current[0]: Reading...
module.grants_prepared_data_bucket.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.email_delivery_bucket.data.aws_canonical_user_id.default[0]: Reading...
module.email_delivery_bucket.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.lambda_artifacts_bucket.aws_s3_bucket.default[0]: Refreshing state... [id=grantsingest-staging-lambdaartifacts-357150818708-us-west-2]
module.grants_prepared_data_bucket.aws_s3_bucket.default[0]: Refreshing state... [id=grantsingest-staging-grantsprepareddata-357150818708-us-west-2]
module.lambda_artifacts_bucket.data.aws_canonical_user_id.default[0]: Read complete after 0s [id=908fcaa3526bcd94649f1b7d5e57a2d26eed8383a46040a685ea6c39d3b3f6c0]
module.grants_source_data_bucket.data.aws_canonical_user_id.default[0]: Read complete after 0s [id=908fcaa3526bcd94649f1b7d5e57a2d26eed8383a46040a685ea6c39d3b3f6c0]
module.email_delivery_bucket.aws_s3_bucket.default[0]: Refreshing state... [id=grantsingest-staging-emaildelivery-357150818708-us-west-2]
module.grants_prepared_data_bucket.data.aws_canonical_user_id.default[0]: Read complete after 0s [id=908fcaa3526bcd94649f1b7d5e57a2d26eed8383a46040a685ea6c39d3b3f6c0]
module.email_delivery_bucket.data.aws_canonical_user_id.default[0]: Read complete after 0s [id=908fcaa3526bcd94649f1b7d5e57a2d26eed8383a46040a685ea6c39d3b3f6c0]
module.grants_source_data_bucket.aws_s3_bucket.default[0]: Refreshing state... [id=grantsingest-staging-grantssourcedata-357150818708-us-west-2]
module.lambda_artifacts_bucket.aws_s3_bucket_public_access_block.default[0]: Refreshing state... [id=grantsingest-staging-lambdaartifacts-357150818708-us-west-2]
module.lambda_artifacts_bucket.aws_s3_bucket_server_side_encryption_configuration.default[0]: Refreshing state... [id=grantsingest-staging-lambdaartifacts-357150818708-us-west-2]
module.lambda_artifacts_bucket.aws_s3_bucket_versioning.default[0]: Refreshing state... [id=grantsingest-staging-lambdaartifacts-357150818708-us-west-2]
module.lambda_artifacts_bucket.data.aws_iam_policy_document.bucket_policy[0]: Reading...
module.lambda_artifacts_bucket.data.aws_iam_policy_document.bucket_policy[0]: Read complete after 0s [id=1129477493]
module.lambda_artifacts_bucket.data.aws_iam_policy_document.aggregated_policy[0]: Reading...
module.lambda_artifacts_bucket.data.aws_iam_policy_document.aggregated_policy[0]: Read complete after 0s [id=3232925033]
module.lambda_artifacts_bucket.aws_s3_bucket_policy.default[0]: Refreshing state... [id=grantsingest-staging-lambdaartifacts-357150818708-us-west-2]
module.grants_prepared_data_bucket.aws_s3_bucket_server_side_encryption_configuration.default[0]: Refreshing state... [id=grantsingest-staging-grantsprepareddata-357150818708-us-west-2]
module.grants_prepared_data_bucket.aws_s3_bucket_versioning.default[0]: Refreshing state... [id=grantsingest-staging-grantsprepareddata-357150818708-us-west-2]
module.grants_prepared_data_bucket.data.aws_iam_policy_document.bucket_policy[0]: Reading...
module.grants_prepared_data_bucket.data.aws_iam_policy_document.bucket_policy[0]: Read complete after 0s [id=3235694163]
module.grants_prepared_data_bucket.aws_s3_bucket_public_access_block.default[0]: Refreshing state... [id=grantsingest-staging-grantsprepareddata-357150818708-us-west-2]
module.lambda_artifacts_bucket.time_sleep.wait_for_aws_s3_bucket_settings[0]: Refreshing state... [id=2023-03-27T16:07:57Z]
module.PersistGrantsGovXMLDB.data.aws_s3_bucket.prepared_data: Reading...
module.SplitGrantsGovXMLDB.data.aws_s3_bucket.prepared_data: Reading...
module.grants_prepared_data_bucket.data.aws_iam_policy_document.aggregated_policy[0]: Reading...
module.grants_prepared_data_bucket.data.aws_iam_policy_document.aggregated_policy[0]: Read complete after 0s [id=1683123059]
module.lambda_artifacts_bucket.aws_s3_bucket_ownership_controls.default[0]: Refreshing state... [id=grantsingest-staging-lambdaartifacts-357150818708-us-west-2]
module.grants_source_data_bucket.aws_s3_bucket_versioning.default[0]: Refreshing state... [id=grantsingest-staging-grantssourcedata-357150818708-us-west-2]
module.grants_source_data_bucket.aws_s3_bucket_server_side_encryption_configuration.default[0]: Refreshing state... [id=grantsingest-staging-grantssourcedata-357150818708-us-west-2]
module.grants_source_data_bucket.aws_s3_bucket_public_access_block.default[0]: Refreshing state... [id=grantsingest-staging-grantssourcedata-357150818708-us-west-2]
module.grants_prepared_data_bucket.aws_s3_bucket_policy.default[0]: Refreshing state... [id=grantsingest-staging-grantsprepareddata-357150818708-us-west-2]
module.grants_source_data_bucket.data.aws_iam_policy_document.bucket_policy[0]: Reading...
module.grants_source_data_bucket.data.aws_iam_policy_document.bucket_policy[0]: Read complete after 0s [id=914045961]
module.lambda_artifacts_bucket.aws_s3_bucket_acl.default[0]: Refreshing state... [id=grantsingest-staging-lambdaartifacts-357150818708-us-west-2,private]
module.email_delivery_bucket.aws_s3_bucket_server_side_encryption_configuration.default[0]: Refreshing state... [id=grantsingest-staging-emaildelivery-357150818708-us-west-2]
module.PersistGrantsGovXMLDB.data.aws_s3_bucket.prepared_data: Read complete after 0s [id=grantsingest-staging-grantsprepareddata-357150818708-us-west-2]
module.email_delivery_bucket.aws_s3_bucket_public_access_block.default[0]: Refreshing state... [id=grantsingest-staging-emaildelivery-357150818708-us-west-2]
module.SplitGrantsGovXMLDB.data.aws_s3_bucket.prepared_data: Read complete after 0s [id=grantsingest-staging-grantsprepareddata-357150818708-us-west-2]
module.email_delivery_bucket.aws_s3_bucket_versioning.default[0]: Refreshing state... [id=grantsingest-staging-emaildelivery-357150818708-us-west-2]
module.grants_source_data_bucket.data.aws_iam_policy_document.aggregated_policy[0]: Reading...
module.grants_source_data_bucket.data.aws_iam_policy_document.aggregated_policy[0]: Read complete after 0s [id=4007971769]
module.grants_prepared_data_bucket.time_sleep.wait_for_aws_s3_bucket_settings[0]: Refreshing state... [id=2023-03-27T16:07:58Z]
module.DownloadGrantsGovDB.data.aws_s3_bucket.grants_source_data: Reading...
module.SplitGrantsGovXMLDB.data.aws_s3_bucket.source_data: Reading...
module.email_delivery_bucket.data.aws_iam_policy_document.bucket_policy[0]: Reading...
module.email_delivery_bucket.data.aws_iam_policy_document.bucket_policy[0]: Read complete after 0s [id=1740433091]
data.aws_iam_policy_document.ses_source_data_s3_access: Reading...
data.aws_iam_policy_document.ses_source_data_s3_access: Read complete after 0s [id=1715607475]
module.grants_source_data_bucket.aws_s3_bucket_policy.default[0]: Refreshing state... [id=grantsingest-staging-grantssourcedata-357150818708-us-west-2]
module.grants_prepared_data_bucket.aws_s3_bucket_ownership_controls.default[0]: Refreshing state... [id=grantsingest-staging-grantsprepareddata-357150818708-us-west-2]
module.DownloadGrantsGovDB.data.aws_s3_bucket.grants_source_data: Read complete after 0s [id=grantsingest-staging-grantssourcedata-357150818708-us-west-2]
module.PersistGrantsGovXMLDB.module.lambda_execution_policy.data.aws_iam_policy_document.this[0]: Reading...
module.PersistGrantsGovXMLDB.module.lambda_execution_policy.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=553011697]
module.grants_source_data_bucket.time_sleep.wait_for_aws_s3_bucket_settings[0]: Refreshing state... [id=2023-03-27T16:07:58Z]
module.grants_source_data_bucket.aws_s3_bucket_ownership_controls.default[0]: Refreshing state... [id=grantsingest-staging-grantssourcedata-357150818708-us-west-2]
module.SplitGrantsGovXMLDB.data.aws_s3_bucket.source_data: Read complete after 0s [id=grantsingest-staging-grantssourcedata-357150818708-us-west-2]
module.DownloadGrantsGovDB.module.lambda_execution_policy.data.aws_iam_policy_document.this[0]: Reading...
module.DownloadGrantsGovDB.module.lambda_execution_policy.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3307065171]
module.email_delivery_bucket.data.aws_iam_policy_document.aggregated_policy[0]: Reading...
module.email_delivery_bucket.data.aws_iam_policy_document.aggregated_policy[0]: Read complete after 0s [id=4125033624]
module.PersistGrantsGovXMLDB.module.lambda_function.aws_iam_policy.additional_json[0]: Refreshing state... [id=arn:aws:iam::357150818708:policy/grants_ingest-staging-PersistGrantsGovXMLDB]
module.email_delivery_bucket.aws_s3_bucket_policy.default[0]: Refreshing state... [id=grantsingest-staging-emaildelivery-357150818708-us-west-2]
module.SplitGrantsGovXMLDB.module.lambda_execution_policy.data.aws_iam_policy_document.this[0]: Reading...
module.SplitGrantsGovXMLDB.module.lambda_execution_policy.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3562714126]
module.grants_prepared_data_bucket.aws_s3_bucket_acl.default[0]: Refreshing state... [id=grantsingest-staging-grantsprepareddata-357150818708-us-west-2,private]
module.email_delivery_bucket.time_sleep.wait_for_aws_s3_bucket_settings[0]: Refreshing state... [id=2023-04-28T14:41:48Z]
module.DownloadGrantsGovDB.module.lambda_function.aws_iam_policy.additional_json[0]: Refreshing state... [id=arn:aws:iam::357150818708:policy/grants_ingest-staging-DownloadGrantsGovDB]
module.PersistGrantsGovXMLDB.module.lambda_function.aws_iam_role_policy_attachment.additional_json[0]: Refreshing state... [id=grants_ingest-staging-PersistGrantsGovXMLDB-20230515134933402000000002]
module.email_delivery_bucket.aws_s3_bucket_ownership_controls.default[0]: Refreshing state... [id=grantsingest-staging-emaildelivery-357150818708-us-west-2]
module.grants_source_data_bucket.aws_s3_bucket_acl.default[0]: Refreshing state... [id=grantsingest-staging-grantssourcedata-357150818708-us-west-2,private]
module.SplitGrantsGovXMLDB.module.lambda_function.aws_iam_policy.additional_json[0]: Refreshing state... [id=arn:aws:iam::357150818708:policy/grants_ingest-staging-SplitGrantsGovXMLDB]
module.DownloadGrantsGovDB.module.lambda_function.aws_iam_role_policy_attachment.additional_json[0]: Refreshing state... [id=grants_ingest-staging-DownloadGrantsGovDB-20230404222446850000000004]
module.email_delivery_bucket.aws_s3_bucket_acl.default[0]: Refreshing state... [id=grantsingest-staging-emaildelivery-357150818708-us-west-2,private]
module.SplitGrantsGovXMLDB.module.lambda_function.aws_iam_role_policy_attachment.additional_json[0]: Refreshing state... [id=grants_ingest-staging-SplitGrantsGovXMLDB-20230404222446809500000002]
module.lambda_artifacts_bucket.aws_s3_bucket_lifecycle_configuration.default[0]: Refreshing state... [id=grantsingest-staging-lambdaartifacts-357150818708-us-west-2]
module.grants_prepared_data_bucket.aws_s3_bucket_lifecycle_configuration.default[0]: Refreshing state... [id=grantsingest-staging-grantsprepareddata-357150818708-us-west-2]
module.grants_source_data_bucket.aws_s3_bucket_lifecycle_configuration.default[0]: Refreshing state... [id=grantsingest-staging-grantssourcedata-357150818708-us-west-2]
module.email_delivery_bucket.aws_s3_bucket_lifecycle_configuration.default[0]: Refreshing state... [id=grantsingest-staging-emaildelivery-357150818708-us-west-2]
module.DownloadGrantsGovDB.module.lambda_function.data.external.archive_prepare[0]: Read complete after 6s [id=-]
module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=38a00c105a016d17a4158cf8b91264b6118850d2]
module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0]: Refreshing state... [id=5226290124175115319]
module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0]: Refreshing state... [id=7629561715463813910]
module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0]: Refreshing state... [id=builds/502569802ca1e18983ce54772463f31b43e0550e77f45996aac3eddf3f8fd7c2.zip]
module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=grants_ingest-staging-DownloadGrantsGovDB]
module.SplitGrantsGovXMLDB.module.lambda_function.data.external.archive_prepare[0]: Read complete after 7s [id=-]
module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=6faa25b9ee56c68ff5a0699071b6fa054123ec10]
module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0]: Refreshing state... [id=3570055206372626219]
module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0]: Refreshing state... [id=2643051294263430821]
module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0]: Refreshing state... [id=builds/b97afc20683289001ba6b2dad5339b0405625c5a9f0ad16b98a31c24ceff973d.zip]
module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=grants_ingest-staging-SplitGrantsGovXMLDB]
module.PersistGrantsGovXMLDB.module.lambda_function.data.external.archive_prepare[0]: Read complete after 7s [id=-]
module.PersistGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=b7bc0c811a02190ba919229778d993010e58900a]
module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.archive[0]: Refreshing state... [id=8887915230947159191]
module.PersistGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0]: Refreshing state... [id=builds/c429c4d1e1525e0ccba3c719448a9b07d3118355b11cce61584967c521832a01.zip]
module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0]: Refreshing state... [id=2894273590632657451]
module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=grants_ingest-staging-PersistGrantsGovXMLDB]
module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"]: Refreshing state... [id=S3BucketNotification]
module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["S3BucketNotification"]: Refreshing state... [id=S3BucketNotification]
module.DownloadGrantsGovDB.aws_scheduler_schedule.default[0]: Refreshing state... [id=grants_ingest-staging/grants_ingest-staging-DownloadGrantsGovDB]
module.DownloadGrantsGovDB.data.aws_iam_policy_document.allow_invoke_lambda: Reading...
module.DownloadGrantsGovDB.data.aws_iam_policy_document.allow_invoke_lambda: Read complete after 0s [id=3054080791]
module.DownloadGrantsGovDB.aws_iam_role_policy.scheduler_execution-allow_invoke_lambda[0]: Refreshing state... [id=grants_ingest-staging-scheduler_exec20230404182115711400000001:terraform-20230404222508921100000006]
module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"]: Refreshing state... [id=S3BucketNotification]
module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["S3BucketNotification"]: Refreshing state... [id=S3BucketNotification]
module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"]: Refreshing state... [id=Schedule]
module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["Schedule"]: Refreshing state... [id=Schedule]
aws_s3_bucket_notification.grant_prepared_data: Refreshing state... [id=grantsingest-staging-grantsprepareddata-357150818708-us-west-2]
module.SplitFFISSpreadsheet.data.aws_s3_bucket.source_data: Reading...
module.EnqueueFFISDownload.data.aws_s3_bucket.source_data: Reading...
module.DownloadFFISSpreadsheet.data.aws_sqs_queue.ffis_downloads: Reading...
module.EnqueueFFISDownload.data.aws_sqs_queue.ffis_downloads: Reading...
module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_caller_identity.current: Reading...
module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_region.current: Reading...
module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_partition.current: Reading...
module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.ExtractGrantsGovDBToXML.module.lambda_function.data.aws_caller_identity.current: Reading...
module.ExtractGrantsGovDBToXML.module.lambda_function.data.aws_partition.current: Reading...
module.ExtractGrantsGovDBToXML.module.lambda_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.PersistFFISData.module.lambda_function.data.aws_partition.current: Reading...
module.PersistFFISData.module.lambda_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.EnqueueFFISDownload.module.lambda_function.data.aws_partition.current: Reading...
module.EnqueueFFISDownload.module.lambda_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.PersistFFISData.module.lambda_function.data.aws_region.current: Reading...
module.ExtractGrantsGovDBToXML.module.lambda_function.data.aws_region.current: Reading...
module.PersistFFISData.module.lambda_function.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.ExtractGrantsGovDBToXML.module.lambda_function.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.SplitFFISSpreadsheet.module.lambda_function.data.aws_caller_identity.current: Reading...
module.EnqueueFFISDownload.module.lambda_function.data.aws_region.current: Reading...
module.SplitFFISSpreadsheet.module.lambda_function.data.aws_region.current: Reading...
module.EnqueueFFISDownload.module.lambda_function.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.SplitFFISSpreadsheet.module.lambda_function.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.EnqueueFFISDownload.module.lambda_function.data.aws_caller_identity.current: Reading...
module.ExtractGrantsGovDBToXML.data.aws_s3_bucket.source_data: Reading...
module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_caller_identity.current: Read complete after 0s [id=357150818708]
module.SplitFFISSpreadsheet.module.lambda_function.data.aws_partition.current: Reading...
module.SplitFFISSpreadsheet.module.lambda_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.DownloadFFISSpreadsheet.data.aws_s3_bucket.download_target: Reading...
module.ExtractGrantsGovDBToXML.module.lambda_function.data.aws_caller_identity.current: Read complete after 0s [id=357150818708]
module.PersistFFISData.module.lambda_function.data.aws_caller_identity.current: Reading...
module.SplitFFISSpreadsheet.module.lambda_function.data.aws_caller_identity.current: Read complete after 0s [id=357150818708]
module.PersistFFISData.data.aws_s3_bucket.source_data: Reading...
module.EnqueueFFISDownload.module.lambda_function.data.aws_caller_identity.current: Read complete after 0s [id=357150818708]
module.SplitFFISSpreadsheet.data.aws_s3_bucket.prepared_data: Reading...
module.PersistFFISData.module.lambda_function.data.aws_caller_identity.current: Read complete after 0s [id=357150818708]
module.EnqueueFFISDownload.module.lambda_function.data.external.archive_prepare[0]: Reading...
module.SplitFFISSpreadsheet.data.aws_s3_bucket.source_data: Read complete after 0s [id=grantsingest-staging-grantssourcedata-357150818708-us-west-2]
module.DownloadFFISSpreadsheet.module.lambda_function.data.external.archive_prepare[0]: Reading...
module.SplitFFISSpreadsheet.module.lambda_function.data.external.archive_prepare[0]: Reading...
module.EnqueueFFISDownload.data.aws_s3_bucket.source_data: Read complete after 0s [id=grantsingest-staging-grantssourcedata-357150818708-us-west-2]
module.ExtractGrantsGovDBToXML.module.lambda_function.data.external.archive_prepare[0]: Reading...
module.ExtractGrantsGovDBToXML.data.aws_s3_bucket.source_data: Read complete after 0s [id=grantsingest-staging-grantssourcedata-357150818708-us-west-2]
module.DownloadFFISSpreadsheet.module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/grants_ingest-staging-DownloadFFISSpreadsheet]
module.SplitFFISSpreadsheet.data.aws_s3_bucket.prepared_data: Read complete after 0s [id=grantsingest-staging-grantsprepareddata-357150818708-us-west-2]
module.PersistFFISData.module.lambda_function.data.external.archive_prepare[0]: Reading...
module.PersistFFISData.data.aws_s3_bucket.source_data: Read complete after 0s [id=grantsingest-staging-grantssourcedata-357150818708-us-west-2]
module.DownloadFFISSpreadsheet.data.aws_s3_bucket.download_target: Read complete after 0s [id=grantsingest-staging-grantssourcedata-357150818708-us-west-2]
module.DownloadFFISSpreadsheet.data.aws_sqs_queue.ffis_downloads: Read complete after 0s [id=https://sqs.us-west-2.amazonaws.com/357150818708/ffis_downloads]
module.ExtractGrantsGovDBToXML.module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/grants_ingest-staging-ExtractGrantsGovDBToXML]
module.EnqueueFFISDownload.module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/grants_ingest-staging-EnqueueFFISDownload]
module.PersistFFISData.module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/grants_ingest-staging-PersistFFISData]
module.EnqueueFFISDownload.data.aws_sqs_queue.ffis_downloads: Read complete after 0s [id=https://sqs.us-west-2.amazonaws.com/357150818708/ffis_downloads]
module.SplitFFISSpreadsheet.module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/grants_ingest-staging-SplitFFISSpreadsheet]
module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.ExtractGrantsGovDBToXML.module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.ExtractGrantsGovDBToXML.module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.PersistFFISData.module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.PersistFFISData.module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.EnqueueFFISDownload.module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.EnqueueFFISDownload.module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.SplitFFISSpreadsheet.module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Reading...
aws_ses_receipt_rule.ffis_ingest: Refreshing state... [id=grants_ingest-staging-ffis_ingest]
module.SplitFFISSpreadsheet.module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.DownloadFFISSpreadsheet.module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=grants_ingest-staging-DownloadFFISSpreadsheet]
module.ExtractGrantsGovDBToXML.module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=grants_ingest-staging-ExtractGrantsGovDBToXML]
module.PersistFFISData.module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=grants_ingest-staging-PersistFFISData]
module.EnqueueFFISDownload.module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=grants_ingest-staging-EnqueueFFISDownload]
module.SplitFFISSpreadsheet.module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=grants_ingest-staging-SplitFFISSpreadsheet]
module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_iam_policy_document.logs[0]: Reading...
module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1433803845]
module.ExtractGrantsGovDBToXML.module.lambda_function.data.aws_iam_policy_document.logs[0]: Reading...
module.EnqueueFFISDownload.module.lambda_function.data.aws_iam_policy_document.logs[0]: Reading...
module.ExtractGrantsGovDBToXML.module.lambda_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3611764972]
module.EnqueueFFISDownload.module.lambda_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2837616078]
module.DownloadFFISSpreadsheet.module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::357150818708:policy/grants_ingest-staging-DownloadFFISSpreadsheet-logs]
module.SplitFFISSpreadsheet.module.lambda_function.data.aws_iam_policy_document.logs[0]: Reading...
module.SplitFFISSpreadsheet.module.lambda_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=204761001]
module.SplitFFISSpreadsheet.module.lambda_execution_policy.data.aws_iam_policy_document.this[0]: Reading...
module.SplitFFISSpreadsheet.module.lambda_execution_policy.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2083699245]
module.PersistFFISData.module.lambda_function.data.aws_iam_policy_document.logs[0]: Reading...
module.PersistFFISData.module.lambda_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2565787960]
module.EnqueueFFISDownload.module.lambda_execution_policy.data.aws_iam_policy_document.this[0]: Reading...
module.EnqueueFFISDownload.module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::357150818708:policy/grants_ingest-staging-EnqueueFFISDownload-logs]
module.ExtractGrantsGovDBToXML.module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::357150818708:policy/grants_ingest-staging-ExtractGrantsGovDBToXML-logs]
module.EnqueueFFISDownload.module.lambda_execution_policy.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=4246279065]
module.SplitFFISSpreadsheet.module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::357150818708:policy/grants_ingest-staging-SplitFFISSpreadsheet-logs]
module.DownloadFFISSpreadsheet.module.lambda_execution_policy.data.aws_iam_policy_document.this[0]: Reading...
module.DownloadFFISSpreadsheet.module.lambda_execution_policy.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3927828840]
module.PersistFFISData.module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::357150818708:policy/grants_ingest-staging-PersistFFISData-logs]
module.PersistFFISData.module.lambda_execution_policy.data.aws_iam_policy_document.this[0]: Reading...
module.PersistFFISData.module.lambda_execution_policy.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3336285595]
module.ExtractGrantsGovDBToXML.module.lambda_execution_policy.data.aws_iam_policy_document.this[0]: Reading...
module.EnqueueFFISDownload.module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=grants_ingest-staging-EnqueueFFISDownload-20230428182625998300000001]
module.SplitFFISSpreadsheet.module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=grants_ingest-staging-SplitFFISSpreadsheet-20230517181411648600000002]
module.ExtractGrantsGovDBToXML.module.lambda_execution_policy.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=4273145939]
module.DownloadFFISSpreadsheet.module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=grants_ingest-staging-DownloadFFISSpreadsheet-20230508161434152500000002]
module.ExtractGrantsGovDBToXML.module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=grants_ingest-staging-ExtractGrantsGovDBToXML-20230525221543210400000002]
module.SplitFFISSpreadsheet.module.lambda_function.aws_iam_policy.additional_json[0]: Refreshing state... [id=arn:aws:iam::357150818708:policy/grants_ingest-staging-SplitFFISSpreadsheet]
module.EnqueueFFISDownload.module.lambda_function.aws_iam_policy.additional_json[0]: Refreshing state... [id=arn:aws:iam::357150818708:policy/grants_ingest-staging-EnqueueFFISDownload]
module.DownloadFFISSpreadsheet.module.lambda_function.aws_iam_policy.additional_json[0]: Refreshing state... [id=arn:aws:iam::357150818708:policy/grants_ingest-staging-DownloadFFISSpreadsheet]
module.PersistFFISData.module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=grants_ingest-staging-PersistFFISData-20230525170237580700000002]
module.PersistFFISData.module.lambda_function.aws_iam_policy.additional_json[0]: Refreshing state... [id=arn:aws:iam::357150818708:policy/grants_ingest-staging-PersistFFISData]
module.ExtractGrantsGovDBToXML.module.lambda_function.aws_iam_policy.additional_json[0]: Refreshing state... [id=arn:aws:iam::357150818708:policy/grants_ingest-staging-ExtractGrantsGovDBToXML]
module.SplitFFISSpreadsheet.module.lambda_function.aws_iam_role_policy_attachment.additional_json[0]: Refreshing state... [id=grants_ingest-staging-SplitFFISSpreadsheet-20230517181411456100000001]
module.EnqueueFFISDownload.module.lambda_function.aws_iam_role_policy_attachment.additional_json[0]: Refreshing state... [id=grants_ingest-staging-EnqueueFFISDownload-20230428182626005900000002]
module.DownloadFFISSpreadsheet.module.lambda_function.aws_iam_role_policy_attachment.additional_json[0]: Refreshing state... [id=grants_ingest-staging-DownloadFFISSpreadsheet-20230508161433816000000001]
module.PersistFFISData.module.lambda_function.aws_iam_role_policy_attachment.additional_json[0]: Refreshing state... [id=grants_ingest-staging-PersistFFISData-20230525170237575200000001]
module.ExtractGrantsGovDBToXML.module.lambda_function.aws_iam_role_policy_attachment.additional_json[0]: Refreshing state... [id=grants_ingest-staging-ExtractGrantsGovDBToXML-20230525221542815900000001]
module.EnqueueFFISDownload.module.lambda_function.data.external.archive_prepare[0]: Read complete after 7s [id=-]
module.EnqueueFFISDownload.module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=2e54307afbfba1a25973475a2d944091ffd46198]
module.EnqueueFFISDownload.module.lambda_function.null_resource.archive[0]: Refreshing state... [id=6070575895732651199]
module.EnqueueFFISDownload.module.lambda_function.aws_s3_object.lambda_package[0]: Refreshing state... [id=builds/53ac74b1d174af744e6ca6d86740012a9335668d485c86e54ebe3f971ea071f8.zip]
module.EnqueueFFISDownload.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0]: Refreshing state... [id=7110405986030761404]
module.DownloadFFISSpreadsheet.module.lambda_function.data.external.archive_prepare[0]: Read complete after 7s [id=-]
module.DownloadFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=165d6e98bb85353ef47b67e44591f15b2167d050]
module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.archive[0]: Refreshing state... [id=8641423062794793762]
module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0]: Refreshing state... [id=245751878519184931]
module.DownloadFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0]: Refreshing state... [id=builds/10d7ec2395eb37a5fd0c4bc094a50c6f4219cd90bf591c533d3cc752c1aaa120.zip]
module.PersistFFISData.module.lambda_function.data.external.archive_prepare[0]: Read complete after 8s [id=-]
module.PersistFFISData.module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=ff40e52343fe7de80e064e996030a2f787e164e1]
module.PersistFFISData.module.lambda_function.null_resource.archive[0]: Refreshing state... [id=4229357725458006227]
module.PersistFFISData.module.lambda_function.aws_s3_object.lambda_package[0]: Refreshing state... [id=builds/62c8d4767a95449eeb499ce798f15f10ef505d229fe7cce2323d561809a34218.zip]
module.PersistFFISData.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0]: Refreshing state... [id=192996766037414230]
module.SplitFFISSpreadsheet.module.lambda_function.data.external.archive_prepare[0]: Read complete after 8s [id=-]
module.SplitFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=7f0e09d0250d2ebcfa69e213713586a129f86290]
module.ExtractGrantsGovDBToXML.module.lambda_function.data.external.archive_prepare[0]: Read complete after 8s [id=-]
module.ExtractGrantsGovDBToXML.module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=94d9ad168be3a68ff289f2a03ea04961d77526c0]
module.SplitFFISSpreadsheet.module.lambda_function.null_resource.archive[0]: Refreshing state... [id=6895959332450193580]
module.SplitFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0]: Refreshing state... [id=builds/f84690920200b636d832f7b9015594c7ff3c1d04b5fe52305f2ab213dd4dfe04.zip]
module.SplitFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0]: Refreshing state... [id=8594275652310339656]
module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.archive[0]: Refreshing state... [id=2626224251114892987]
module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0]: Refreshing state... [id=7346454347998019583]
module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=grants_ingest-staging-EnqueueFFISDownload]
module.ExtractGrantsGovDBToXML.module.lambda_function.aws_s3_object.lambda_package[0]: Refreshing state... [id=builds/41a55d5808deffb7cae0c2edd87f09c8cb46617cea0db0d03656b231240d1dc0.zip]
module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=grants_ingest-staging-DownloadFFISSpreadsheet]
module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=grants_ingest-staging-PersistFFISData]
module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=grants_ingest-staging-SplitFFISSpreadsheet]
module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=grants_ingest-staging-ExtractGrantsGovDBToXML]
module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"]: Refreshing state... [id=SQSQueueNotification]
module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["SQSQueueNotification"]: Refreshing state... [id=SQSQueueNotification]
module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_event_source_mapping.this["sqs"]: Refreshing state... [id=dfb153f3-fe8a-4de6-93e4-b850b9a1722a]
module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["S3BucketNotification"]: Refreshing state... [id=S3BucketNotification]
module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"]: Refreshing state... [id=S3BucketNotification]
module.PersistFFISData.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["S3BucketNotification"]: Refreshing state... [id=S3BucketNotification]
module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"]: Refreshing state... [id=S3BucketNotification]
module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["S3BucketNotification"]: Refreshing state... [id=S3BucketNotification]
module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"]: Refreshing state... [id=S3BucketNotification]
module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["S3BucketNotification"]: Refreshing state... [id=S3BucketNotification]
module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"]: Refreshing state... [id=S3BucketNotification]
aws_s3_bucket_notification.grant_source_data: Refreshing state... [id=grantsingest-staging-grantssourcedata-357150818708-us-west-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2023-06-30T19:47:40.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:10" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:10/invocations" -> (known after apply)
      ~ s3_key                         = "builds/10d7ec2395eb37a5fd0c4bc094a50c6f4219cd90bf591c533d3cc752c1aaa120.zip" -> "builds/15f9a164103e0bdb45c5f7e889e363f7f899ab72b2e1899dd51a5f38fee84c2a.zip"
      ~ s3_object_version              = "UIW7OcdacxYYX9uiA6DKb5WpZk3Gg97W" -> (known after apply)
        tags                           = {}
      ~ version                        = "10" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:57f735227d21be27ac7496365d9d27c0eaaf7213,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet" -> "git.commit.sha:3f326c9ccaec75752e174d6b9797b411f8556a88,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
              ~ "DD_VERSION"                   = "57f735227d21be27ac7496365d9d27c0eaaf7213" -> "3f326c9ccaec75752e174d6b9797b411f8556a88"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "10" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "a333bdf4be39b7a35d63ff57623959b8-2" -> (known after apply)
      ~ id                     = "builds/10d7ec2395eb37a5fd0c4bc094a50c6f4219cd90bf591c533d3cc752c1aaa120.zip" -> (known after apply)
      ~ key                    = "builds/10d7ec2395eb37a5fd0c4bc094a50c6f4219cd90bf591c533d3cc752c1aaa120.zip" -> "builds/15f9a164103e0bdb45c5f7e889e363f7f899ab72b2e1899dd51a5f38fee84c2a.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/10d7ec2395eb37a5fd0c4bc094a50c6f4219cd90bf591c533d3cc752c1aaa120.zip" -> "builds/15f9a164103e0bdb45c5f7e889e363f7f899ab72b2e1899dd51a5f38fee84c2a.zip"
-       tags                   = {} -> null
      ~ version_id             = "UIW7OcdacxYYX9uiA6DKb5WpZk3Gg97W" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadFFISSpreadsheet
                            cd bin/DownloadFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/15f9a164103e0bdb45c5f7e889e363f7f899ab72b2e1899dd51a5f38fee84c2a.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/15f9a164103e0bdb45c5f7e889e363f7f899ab72b2e1899dd51a5f38fee84c2a.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8641423062794793762" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/10d7ec2395eb37a5fd0c4bc094a50c6f4219cd90bf591c533d3cc752c1aaa120.zip" -> "builds/15f9a164103e0bdb45c5f7e889e363f7f899ab72b2e1899dd51a5f38fee84c2a.zip"
          ~ "timestamp" = "1688154423185385000" -> "1688154573460421000"
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "245751878519184931" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/10d7ec2395eb37a5fd0c4bc094a50c6f4219cd90bf591c533d3cc752c1aaa120.zip" -> "builds/15f9a164103e0bdb45c5f7e889e363f7f899ab72b2e1899dd51a5f38fee84c2a.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-06-30T19:47:39.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:35" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:35/invocations" -> (known after apply)
      ~ s3_key                         = "builds/502569802ca1e18983ce54772463f31b43e0550e77f45996aac3eddf3f8fd7c2.zip" -> "builds/85ca7c7b1607bccaeabde558deebb1a94112658004db8f2cd117111400ca6c7f.zip"
      ~ s3_object_version              = "xD3NTsbaGgu7qHkC1.NEUmXfvaf4POBc" -> (known after apply)
        tags                           = {}
      ~ version                        = "35" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:57f735227d21be27ac7496365d9d27c0eaaf7213,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:3f326c9ccaec75752e174d6b9797b411f8556a88,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "57f735227d21be27ac7496365d9d27c0eaaf7213" -> "3f326c9ccaec75752e174d6b9797b411f8556a88"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "35" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "015d009f3f6ee35bcf71ec72e43b0cf1-2" -> (known after apply)
      ~ id                     = "builds/502569802ca1e18983ce54772463f31b43e0550e77f45996aac3eddf3f8fd7c2.zip" -> (known after apply)
      ~ key                    = "builds/502569802ca1e18983ce54772463f31b43e0550e77f45996aac3eddf3f8fd7c2.zip" -> "builds/85ca7c7b1607bccaeabde558deebb1a94112658004db8f2cd117111400ca6c7f.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/502569802ca1e18983ce54772463f31b43e0550e77f45996aac3eddf3f8fd7c2.zip" -> "builds/85ca7c7b1607bccaeabde558deebb1a94112658004db8f2cd117111400ca6c7f.zip"
-       tags                   = {} -> null
      ~ version_id             = "xD3NTsbaGgu7qHkC1.NEUmXfvaf4POBc" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/85ca7c7b1607bccaeabde558deebb1a94112658004db8f2cd117111400ca6c7f.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/85ca7c7b1607bccaeabde558deebb1a94112658004db8f2cd117111400ca6c7f.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5226290124175115319" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/502569802ca1e18983ce54772463f31b43e0550e77f45996aac3eddf3f8fd7c2.zip" -> "builds/85ca7c7b1607bccaeabde558deebb1a94112658004db8f2cd117111400ca6c7f.zip"
          ~ "timestamp" = "1688154403433141000" -> "1688154555457048000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "7629561715463813910" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/502569802ca1e18983ce54772463f31b43e0550e77f45996aac3eddf3f8fd7c2.zip" -> "builds/85ca7c7b1607bccaeabde558deebb1a94112658004db8f2cd117111400ca6c7f.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
      ~ last_modified                  = "2023-06-30T19:47:38.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:15" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:15/invocations" -> (known after apply)
      ~ s3_key                         = "builds/53ac74b1d174af744e6ca6d86740012a9335668d485c86e54ebe3f971ea071f8.zip" -> "builds/3fbe2b1e737d237e91dd74119b0b1cd6bb1806a9b9036fa9f1b786ebe35d73aa.zip"
      ~ s3_object_version              = "C9p1LDj0WtXgnTV5fbFF0HNl30cSzxQJ" -> (known after apply)
        tags                           = {}
      ~ version                        = "15" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:57f735227d21be27ac7496365d9d27c0eaaf7213,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:3f326c9ccaec75752e174d6b9797b411f8556a88,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "57f735227d21be27ac7496365d9d27c0eaaf7213" -> "3f326c9ccaec75752e174d6b9797b411f8556a88"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "15" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "99de8b6245c0fba0bc15d506cfdef0e2-2" -> (known after apply)
      ~ id                     = "builds/53ac74b1d174af744e6ca6d86740012a9335668d485c86e54ebe3f971ea071f8.zip" -> (known after apply)
      ~ key                    = "builds/53ac74b1d174af744e6ca6d86740012a9335668d485c86e54ebe3f971ea071f8.zip" -> "builds/3fbe2b1e737d237e91dd74119b0b1cd6bb1806a9b9036fa9f1b786ebe35d73aa.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/53ac74b1d174af744e6ca6d86740012a9335668d485c86e54ebe3f971ea071f8.zip" -> "builds/3fbe2b1e737d237e91dd74119b0b1cd6bb1806a9b9036fa9f1b786ebe35d73aa.zip"
-       tags                   = {} -> null
      ~ version_id             = "C9p1LDj0WtXgnTV5fbFF0HNl30cSzxQJ" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-EnqueueFFISDownload
                            cd bin/EnqueueFFISDownload
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/3fbe2b1e737d237e91dd74119b0b1cd6bb1806a9b9036fa9f1b786ebe35d73aa.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/3fbe2b1e737d237e91dd74119b0b1cd6bb1806a9b9036fa9f1b786ebe35d73aa.plan.json"
+       id                   = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6070575895732651199" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/53ac74b1d174af744e6ca6d86740012a9335668d485c86e54ebe3f971ea071f8.zip" -> "builds/3fbe2b1e737d237e91dd74119b0b1cd6bb1806a9b9036fa9f1b786ebe35d73aa.zip"
          ~ "timestamp" = "1688154424171137000" -> "1688154573305470000"
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "7110405986030761404" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/53ac74b1d174af744e6ca6d86740012a9335668d485c86e54ebe3f971ea071f8.zip" -> "builds/3fbe2b1e737d237e91dd74119b0b1cd6bb1806a9b9036fa9f1b786ebe35d73aa.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-ExtractGrantsGovDBToXML"
      ~ last_modified                  = "2023-06-30T19:47:38.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ExtractGrantsGovDBToXML:4" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ExtractGrantsGovDBToXML:4/invocations" -> (known after apply)
      ~ s3_key                         = "builds/41a55d5808deffb7cae0c2edd87f09c8cb46617cea0db0d03656b231240d1dc0.zip" -> "builds/bf64546eaad2e598ccfd991f0ca4000026943045631f139f406b773401641b00.zip"
      ~ s3_object_version              = "XdaCCNDRJeTkmh1kj91zQcjZjmOwbx4o" -> (known after apply)
        tags                           = {}
      ~ version                        = "4" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:57f735227d21be27ac7496365d9d27c0eaaf7213,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml" -> "git.commit.sha:3f326c9ccaec75752e174d6b9797b411f8556a88,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml"
              ~ "DD_VERSION"                   = "57f735227d21be27ac7496365d9d27c0eaaf7213" -> "3f326c9ccaec75752e174d6b9797b411f8556a88"
                # (11 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "4" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "9e1d1b44eb3d49dfbf5f19e556dedf0a-2" -> (known after apply)
      ~ id                     = "builds/41a55d5808deffb7cae0c2edd87f09c8cb46617cea0db0d03656b231240d1dc0.zip" -> (known after apply)
      ~ key                    = "builds/41a55d5808deffb7cae0c2edd87f09c8cb46617cea0db0d03656b231240d1dc0.zip" -> "builds/bf64546eaad2e598ccfd991f0ca4000026943045631f139f406b773401641b00.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/41a55d5808deffb7cae0c2edd87f09c8cb46617cea0db0d03656b231240d1dc0.zip" -> "builds/bf64546eaad2e598ccfd991f0ca4000026943045631f139f406b773401641b00.zip"
-       tags                   = {} -> null
      ~ version_id             = "XdaCCNDRJeTkmh1kj91zQcjZjmOwbx4o" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-ExtractGrantsGovDBToXML
                            cd bin/ExtractGrantsGovDBToXML
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/bf64546eaad2e598ccfd991f0ca4000026943045631f139f406b773401641b00.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/bf64546eaad2e598ccfd991f0ca4000026943045631f139f406b773401641b00.plan.json"
+       id                   = (known after apply)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "2626224251114892987" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/41a55d5808deffb7cae0c2edd87f09c8cb46617cea0db0d03656b231240d1dc0.zip" -> "builds/bf64546eaad2e598ccfd991f0ca4000026943045631f139f406b773401641b00.zip"
          ~ "timestamp" = "1688154423418058000" -> "1688154573716913000"
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "7346454347998019583" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/41a55d5808deffb7cae0c2edd87f09c8cb46617cea0db0d03656b231240d1dc0.zip" -> "builds/bf64546eaad2e598ccfd991f0ca4000026943045631f139f406b773401641b00.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistFFISData"
      ~ last_modified                  = "2023-06-30T19:47:38.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistFFISData:5" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistFFISData:5/invocations" -> (known after apply)
      ~ s3_key                         = "builds/62c8d4767a95449eeb499ce798f15f10ef505d229fe7cce2323d561809a34218.zip" -> "builds/5faad487864d3aca76263b9c2f3ab5eb432ba7f40f2ae283be6b974345dd4f74.zip"
      ~ s3_object_version              = "ZKBDhpvCYhjDINbl0jd6ZtT.lFZ3LasB" -> (known after apply)
        tags                           = {}
      ~ version                        = "5" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:57f735227d21be27ac7496365d9d27c0eaaf7213,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata" -> "git.commit.sha:3f326c9ccaec75752e174d6b9797b411f8556a88,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata"
              ~ "DD_VERSION"                    = "57f735227d21be27ac7496365d9d27c0eaaf7213" -> "3f326c9ccaec75752e174d6b9797b411f8556a88"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "5" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "df30e80fc9c7b8564850b91d5bf12093-2" -> (known after apply)
      ~ id                     = "builds/62c8d4767a95449eeb499ce798f15f10ef505d229fe7cce2323d561809a34218.zip" -> (known after apply)
      ~ key                    = "builds/62c8d4767a95449eeb499ce798f15f10ef505d229fe7cce2323d561809a34218.zip" -> "builds/5faad487864d3aca76263b9c2f3ab5eb432ba7f40f2ae283be6b974345dd4f74.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/62c8d4767a95449eeb499ce798f15f10ef505d229fe7cce2323d561809a34218.zip" -> "builds/5faad487864d3aca76263b9c2f3ab5eb432ba7f40f2ae283be6b974345dd4f74.zip"
-       tags                   = {} -> null
      ~ version_id             = "ZKBDhpvCYhjDINbl0jd6ZtT.lFZ3LasB" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistFFISData
                            cd bin/PersistFFISData
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/5faad487864d3aca76263b9c2f3ab5eb432ba7f40f2ae283be6b974345dd4f74.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/5faad487864d3aca76263b9c2f3ab5eb432ba7f40f2ae283be6b974345dd4f74.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistFFISData.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4229357725458006227" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/62c8d4767a95449eeb499ce798f15f10ef505d229fe7cce2323d561809a34218.zip" -> "builds/5faad487864d3aca76263b9c2f3ab5eb432ba7f40f2ae283be6b974345dd4f74.zip"
          ~ "timestamp" = "1688154424056480800" -> "1688154573628084000"
        }
    }

  # module.PersistFFISData.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "192996766037414230" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/62c8d4767a95449eeb499ce798f15f10ef505d229fe7cce2323d561809a34218.zip" -> "builds/5faad487864d3aca76263b9c2f3ab5eb432ba7f40f2ae283be6b974345dd4f74.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistGrantsGovXMLDB"
      ~ last_modified                  = "2023-06-30T19:47:41.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:7" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:7/invocations" -> (known after apply)
      ~ s3_key                         = "builds/c429c4d1e1525e0ccba3c719448a9b07d3118355b11cce61584967c521832a01.zip" -> "builds/15010037a446a6dfc934fb74b39fa399e2c4d8be15068db6e4848d8b2f17e21d.zip"
      ~ s3_object_version              = "bkhN1OcTNVYq4J8.6fXY2Qy3TYQ5FxKz" -> (known after apply)
        tags                           = {}
      ~ version                        = "7" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:57f735227d21be27ac7496365d9d27c0eaaf7213,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb" -> "git.commit.sha:3f326c9ccaec75752e174d6b9797b411f8556a88,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb"
              ~ "DD_VERSION"                    = "57f735227d21be27ac7496365d9d27c0eaaf7213" -> "3f326c9ccaec75752e174d6b9797b411f8556a88"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "7" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "520b8d477afce31581a9c2f135ad3fe2-2" -> (known after apply)
      ~ id                     = "builds/c429c4d1e1525e0ccba3c719448a9b07d3118355b11cce61584967c521832a01.zip" -> (known after apply)
      ~ key                    = "builds/c429c4d1e1525e0ccba3c719448a9b07d3118355b11cce61584967c521832a01.zip" -> "builds/15010037a446a6dfc934fb74b39fa399e2c4d8be15068db6e4848d8b2f17e21d.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/c429c4d1e1525e0ccba3c719448a9b07d3118355b11cce61584967c521832a01.zip" -> "builds/15010037a446a6dfc934fb74b39fa399e2c4d8be15068db6e4848d8b2f17e21d.zip"
-       tags                   = {} -> null
      ~ version_id             = "bkhN1OcTNVYq4J8.6fXY2Qy3TYQ5FxKz" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistGrantsGovXMLDB
                            cd bin/PersistGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/15010037a446a6dfc934fb74b39fa399e2c4d8be15068db6e4848d8b2f17e21d.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/15010037a446a6dfc934fb74b39fa399e2c4d8be15068db6e4848d8b2f17e21d.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8887915230947159191" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c429c4d1e1525e0ccba3c719448a9b07d3118355b11cce61584967c521832a01.zip" -> "builds/15010037a446a6dfc934fb74b39fa399e2c4d8be15068db6e4848d8b2f17e21d.zip"
          ~ "timestamp" = "1688154403298282000" -> "1688154555895266000"
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "2894273590632657451" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/c429c4d1e1525e0ccba3c719448a9b07d3118355b11cce61584967c521832a01.zip" -> "builds/15010037a446a6dfc934fb74b39fa399e2c4d8be15068db6e4848d8b2f17e21d.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitFFISSpreadsheet"
      ~ last_modified                  = "2023-06-30T19:47:38.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:6/invocations" -> (known after apply)
      ~ s3_key                         = "builds/f84690920200b636d832f7b9015594c7ff3c1d04b5fe52305f2ab213dd4dfe04.zip" -> "builds/8f547a8f1d2de228afd68b952612656c7e0342296ab377babfe041b0eadc09e5.zip"
      ~ s3_object_version              = "vixXzYPpvxKcQA.Tl_kUUDZwMOXfeLwk" -> (known after apply)
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:57f735227d21be27ac7496365d9d27c0eaaf7213,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet" -> "git.commit.sha:3f326c9ccaec75752e174d6b9797b411f8556a88,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet"
              ~ "DD_VERSION"                       = "57f735227d21be27ac7496365d9d27c0eaaf7213" -> "3f326c9ccaec75752e174d6b9797b411f8556a88"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "6" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "6753021b3b6a2900eabdc91895d3b0c8-2" -> (known after apply)
      ~ id                     = "builds/f84690920200b636d832f7b9015594c7ff3c1d04b5fe52305f2ab213dd4dfe04.zip" -> (known after apply)
      ~ key                    = "builds/f84690920200b636d832f7b9015594c7ff3c1d04b5fe52305f2ab213dd4dfe04.zip" -> "builds/8f547a8f1d2de228afd68b952612656c7e0342296ab377babfe041b0eadc09e5.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/f84690920200b636d832f7b9015594c7ff3c1d04b5fe52305f2ab213dd4dfe04.zip" -> "builds/8f547a8f1d2de228afd68b952612656c7e0342296ab377babfe041b0eadc09e5.zip"
-       tags                   = {} -> null
      ~ version_id             = "vixXzYPpvxKcQA.Tl_kUUDZwMOXfeLwk" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitFFISSpreadsheet
                            cd bin/SplitFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/8f547a8f1d2de228afd68b952612656c7e0342296ab377babfe041b0eadc09e5.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/8f547a8f1d2de228afd68b952612656c7e0342296ab377babfe041b0eadc09e5.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6895959332450193580" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/f84690920200b636d832f7b9015594c7ff3c1d04b5fe52305f2ab213dd4dfe04.zip" -> "builds/8f547a8f1d2de228afd68b952612656c7e0342296ab377babfe041b0eadc09e5.zip"
          ~ "timestamp" = "1688154423946140000" -> "1688154573713593000"
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "8594275652310339656" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/f84690920200b636d832f7b9015594c7ff3c1d04b5fe52305f2ab213dd4dfe04.zip" -> "builds/8f547a8f1d2de228afd68b952612656c7e0342296ab377babfe041b0eadc09e5.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-06-30T19:47:41.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:34" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:34/invocations" -> (known after apply)
      ~ s3_key                         = "builds/b97afc20683289001ba6b2dad5339b0405625c5a9f0ad16b98a31c24ceff973d.zip" -> "builds/192c1e64052e28d567e06a6f3a8dd52549cbbdaf185b6b2d93e8e9253d9c99c5.zip"
      ~ s3_object_version              = "GEpX2OTZ2FcWrDnDBJAVBLWMmRDNSmVT" -> (known after apply)
        tags                           = {}
      ~ version                        = "34" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:57f735227d21be27ac7496365d9d27c0eaaf7213,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:3f326c9ccaec75752e174d6b9797b411f8556a88,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "57f735227d21be27ac7496365d9d27c0eaaf7213" -> "3f326c9ccaec75752e174d6b9797b411f8556a88"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "34" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "927c3764d506920ccd5dd50e87d63a62-2" -> (known after apply)
      ~ id                     = "builds/b97afc20683289001ba6b2dad5339b0405625c5a9f0ad16b98a31c24ceff973d.zip" -> (known after apply)
      ~ key                    = "builds/b97afc20683289001ba6b2dad5339b0405625c5a9f0ad16b98a31c24ceff973d.zip" -> "builds/192c1e64052e28d567e06a6f3a8dd52549cbbdaf185b6b2d93e8e9253d9c99c5.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/b97afc20683289001ba6b2dad5339b0405625c5a9f0ad16b98a31c24ceff973d.zip" -> "builds/192c1e64052e28d567e06a6f3a8dd52549cbbdaf185b6b2d93e8e9253d9c99c5.zip"
-       tags                   = {} -> null
      ~ version_id             = "GEpX2OTZ2FcWrDnDBJAVBLWMmRDNSmVT" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/192c1e64052e28d567e06a6f3a8dd52549cbbdaf185b6b2d93e8e9253d9c99c5.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/192c1e64052e28d567e06a6f3a8dd52549cbbdaf185b6b2d93e8e9253d9c99c5.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "3570055206372626219" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/b97afc20683289001ba6b2dad5339b0405625c5a9f0ad16b98a31c24ceff973d.zip" -> "builds/192c1e64052e28d567e06a6f3a8dd52549cbbdaf185b6b2d93e8e9253d9c99c5.zip"
          ~ "timestamp" = "1688154403336624000" -> "1688154555634614000"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "2643051294263430821" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/b97afc20683289001ba6b2dad5339b0405625c5a9f0ad16b98a31c24ceff973d.zip" -> "builds/192c1e64052e28d567e06a6f3a8dd52549cbbdaf185b6b2d93e8e9253d9c99c5.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 40 to add, 13 to change, 32 to destroy.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/5426448969)*